product = {'ดินสอกด pentel': {'ราคา':50,'สี':'แดง'},
           'ยางลบ': {'ราคา':5,'สี':'ขาว'},
           'ดินสอสี': {'ราคา':100,'สี':'ส้ม'},}


while True:
    print('------กรุณากรอกข้อมูล------')
    p = input('ชื่อสินค้า: ')
    q= int (input('จำนวน: '))
    print('-------')
    if p in product:
        print(f'สินค้า: {p} \nราคา: {product[p]['ราคา']} บาท  \nสี: {product[p]['สี']}')
        print(f'จำนวน: {q} ชิ้น \nรวม: {product[p] ['ราคา'] * q} บาท')
    else:
        print('ไม่มีสินค้าในระบบ')
    #ออกจากลูปโดยการกด Ctrl+C (ตอนที่รันแล้ว)   